<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<%@ taglib prefix = "c" uri = "http://java.sun.com/jsp/jstl/core" %>
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html class="log-head">
<head>
		<title>Техномаркет - карта на магазини</title>
		<link href="<c:url value="/css/common_stores_styles.css" />" rel="stylesheet">
		<script src="https://maps.googleapis.com/maps/api/js?key=AIzaSyDkHN_gdiuaWXmHeLB8Fpe_pBc840VRgIk&callback=map"
        type="text/javascript"></script>
</head>
<body>

<div id="map"></div>

<script type="text/javascript">
    var locations = [
    	['ТЕХНОМАРКЕТ ПЛОВДИВ Марково Тепе', 42.1410462,24.7408077, 5],
    	['ТЕХНОМАРКЕТ ГОЦЕ ДЕЛЧЕВ', 41.575522, 23.742941, 3],
    	['ТЕХНОМАРКЕТ КАРЛОВО', 42.631848, 24.813627, 2],
    	['ТЕХНОМАРКЕТ САМОКОВ', 42.344898,23.552257, 1],
    	['ТЕХНОМАРКЕТ РУСЕ', 43.851923, 25.987681, 4],
    	['ТЕХНОМАРКЕТ БУРГАС 3', 42.47228,27.432354, 5],
    	['ТЕХНОМАРКЕТ АСЕНОВГРАД', 42.018458, 24.863881, 3],
    	['ТЕХНОМАРКЕТ САНДАНСКИ', 41.5550821,23.2766425, 2],
    	['ТЕХНОМАРКЕТ ПЕРНИК', 42.607379,23.0436649, 1],
    	['ТЕХНОМАРКЕТ БАНСКО', 41.843614, 23.485874, 4],
    	['ТЕХНОМАРКЕТ СВИЛЕНГРАД',41.770994, 26.198982, 5],
    	['ТЕХНОМАРКЕТ ДУПНИЦА', 42.2670743,23.113473, 3],
    	['ТЕХНОМАРКЕТ СЕВЛИЕВО', 43.029479, 25.092194, 2],
    	['ТЕХНОМАРКЕТ ПЛОВДИВ 2',42.144937, 24.780397, 1],
    	['ТЕХНОМАРКЕТ ВАРНА', 43.232355, 27.866251, 4],
    	['ТЕХНОМАРКЕТ СОФИЯ РИНГ МОЛ', 42.624141, 23.352072, 5],
    	['ТЕХНОМАРКЕТ @ХОУМ РИНГ МОЛ', 42.624141, 23.352072, 3],
    	['ТЕХНОМАРКЕТ ПЛОВДИВ', 42.155367, 24.707133, 2],
    	['ТЕХНОМАРКЕТ ХАСКОВО', 41.931616, 25.604517, 1],
    	['ТЕХНОМАРКЕТ СМОЛЯН', 41.567505,24.737041, 4],
    	['ТЕХНОМАРКЕТ ПЪРВОМАЙ', 42.090484, 25.210853, 5],
    	['ТЕХНОМАРКЕТ КАЗАНЛЪК', 42.616754, 25.370239, 3],
    	['ТЕХНОМАРКЕТ СТАРА ЗАГОРА 2', 42.889317, 25.294217, 2],
    	['ТЕХНОМАРКЕТ СИЛИСТРА', 44.1135092,27.2525336, 1],
    	['ТЕХНОМАРКЕТ ПЛЕВЕН', 43.407877,24.636347, 4],
    	['ТЕХНОМАРКЕТ ЛОВЕЧ', 43.135582,24.716942, 5],
    	['ТЕХНОМАРКЕТ ДОБРИЧ', 43.579293, 27.832293, 3],
    	['ТЕХНОМАРКЕТ КЪРДЖАЛИ', 41.633983, 25.380267, 2],
    	['ТЕХНОМАРКЕТ ДИМИТРОВГРАД', 42.05894,25.585501, 1],
    	['ТЕХНОМАРКЕТ ГАБРОВО', 42.889317, 25.294217, 4],
    	['ТЕХНОМАРКЕТ ВЕЛИКО ТЪРНОВО', 43.073250, 25.614917, 5],
    	['ТЕХНОМАРКЕТ БУРГАС ГАЛЕРИЯ МОЛ', 42.513611,27.453889, 3],
    	['ТЕХНОМАРКЕТ СОФИЯ ВЛАДИМИР ВАЗОВ', 42.710150,23.394267, 2],
    	['ТЕХНОМАРКЕТ БУЛ. СИМЕОНОВСКО ШОСЕ 110', 42.6413210000, 23.3346060000, 1],
    	['ТЕХНОМАРКЕТ ВАРНА 2 ГРАНД МОЛ', 43.217998, 27.898016, 1],
    	['ТЕХНОМАРКЕТ ПАРК ЦЕНТЪР СОФИЯ', 42.645153,23.394451, 5],
    	['ТЕХНОМАРКЕТ СОФИЯ MALL OF SOFIA', 42.678533,23.321100, 4],
        ['ТЕХНОМАРКЕТ СВИЩОВ', 43.615262, 25.343721, 3],
        ['ЕХНОМАРКЕТ НАДЕЖДА', 42.723796, 23.305759, 2],
        ['ТЕХНОМАРКЕТ БУРГАС', 42.519503, 27.461695, 1],
        ['ТЕХНОМАРКЕТ СОФИЯ MALL OF SOFIA', 42.698267, 23.308605, 4],
        ['ТЕХНОМАРКЕТ ПАРК ЦЕНТЪР СОФИЯ', 42.678533, 23.321100, 5],
        ['ТЕХНОМАРКЕТ БЛАГОЕВГРАД', 41.997450, 23.087867, 3],
        ['ТЕХНОМАРКЕТ БЛАГОЕВГРАД', 41.997450, 23.087867, 2],
        ['ТЕХНОМАРКЕТ ТЪРГОВИЩЕ', 43.247396, 26.559423, 1]
    ];
    var map = new google.maps.Map(document.getElementById('map'), {
        zoom: 6,
        center: new google.maps.LatLng(41.6295049,25.0616878),
        mapTypeId: google.maps.MapTypeId.ROADMAP
    });
    var infowindow = new google.maps.InfoWindow();
    var marker, i;
    for (i = 0; i < locations.length; i++) {
        marker = new google.maps.Marker({
            position: new google.maps.LatLng(locations[i][1], locations[i][2]),
            map: map
        });
        google.maps.event.addListener(marker, 'click', (function(marker, i) {
            return function() {
                infowindow.setContent(locations[i][0]);
                infowindow.open(map, marker);
            }
        })(marker, i));
    }
</script>
</body>
</html>